
you_number = int(input("Введите Ваше число: "))

print("Следующее число после: ", you_number , "это: ", you_number +1 , " а предыдущее: ", you_number -1)  # СОВЕТ: математические операторы лучше обрамлять пробелами с двух сторон, то есть в вашем случае будет you_number + 1 и you_number - 1

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     20

# Пример вывода:
#     Следующее за числом 20 число: 21
#     Для числа 20 предыдущее число: 19